'''
    Реализовать скрипт, в котором должна быть предусмотрена функция расчета заработной
    платы сотрудника. В расчете необходимо использовать формулу: (выработка в часах*ставка в
    час) + премия. Для выполнения расчета для конкретных значений необходимо запускать
    скрипт с параметрами.
'''

from sys import argv
  
def func_rate_rur():
    while True:
        try:
            work_h = float(argv[1]) # допустим, 3.1 человеко-часов
            rate_rur_h, prize_rur = map(int, argv[2:]) # пусть по правилам организации ценник на чел-час и премия исчисляются целыми
            return (work_h * rate_rur_h) + prize_rur
            break
        except IndexError:
            print('Что-то не так с параметрами. Их должно быть 3, типы: float, int, int')
            break
        except ValueError:
            print('Что-то не так с параметрами. Их должно быть 3, типы: float, int, int')
            break

print(func_rate_rur())