'''
    Представлен список чисел. Определить элементы списка, не имеющие повторений.
    Сформировать итоговый массив чисел, соответствующих требованию. Элементы вывести в
    порядке их следования в исходном списке. Для выполнения задания обязательно
    использовать генератор.
    Пример исходного списка: [2, 2, 2, 7, 23, 1, 44, 44, 3, 2, 10, 7, 4, 11].
    Результат: [23, 1, 3, 10, 4, 11]
'''

from random import randint

first_list = [randint(0, 10) for el in range(randint(10, 20))] #[2, 2, 2, 7, 23, 1, 44, 44, 3, 2, 10, 7, 4, 11]
print(first_list)

''' прежде чем написать генераторв 1 строчку я пробую написать полный цикл:
for el in first_list:
    if first_list.count(el) == 1:
        print(el)
'''

next_list = [el for el in first_list if first_list.count(el) == 1]
print(next_list)


    