'''
    Представлен список чисел. Необходимо вывести элементы исходного списка, значения
    которых больше предыдущего элемента.
    Подсказка: элементы, удовлетворяющие условию, оформить в виде списка. Для
    формирования списка использовать генератор.
    Пример исходного списка: [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55].
    Результат: [12, 44, 4, 10, 78, 123].
'''
from random import randint

num_list = [randint(0, 10) for el in range(10)]
print(num_list)

''' длинная запись без генератора '''
new_list = []
for i in range(0, len(num_list) - 1):
    if num_list[i + 1] > num_list[i]:
        new_list.append(num_list[i + 1])
    else:
        continue
print(new_list)

''' длинная запись в виде генератора '''
new_list = [num_list[i + 1] for i in range(0, len(num_list) - 1) if num_list[i + 1] > num_list[i]]
print(new_list)

'''
    можно как-то перейти от индексам к элементам,
    но работает иначе, чем предыдущие реализации. На практике видно, что 
    num_list[-1] = num_list[len(num_list)], что, признаться, неожиданно!
    то есть это беговая дорожка
    заметить разницу между реализациями я это мог только при рандум-генераторе списка,
    какой я молодец, что проверял на нём
'''
new_list = [el for i, el in enumerate(num_list) if num_list[i] > num_list[i - 1]]
print(new_list)