'''
    Создать класс TrafficLight (светофор) и определить у него один атрибут color (цвет) и метод
    running (запуск). Атрибут реализовать как приватный. В рамках метода реализовать
    переключение светофора в режимы: красный, желтый, зеленый. Продолжительность первого
    состояния (красный) составляет 7 секунд, второго (желтый) — 2 секунды, третьего (зеленый)
    — на ваше усмотрение. Переключение между режимами должно осуществляться только в
    указанном порядке (красный, желтый, зеленый). Проверить работу примера, создав экземпляр
    и вызвав описанный метод
    
    Задачу можно усложнить, реализовав проверку порядка режимов, и при его нарушении
    выводить соответствующее сообщение и завершать скрипт.    
'''

from time import sleep
from itertools import cycle

class TrafficLight:
    __color = [['red', 1], ['yellow', 2], ['green', 3]]
    
    def running(self):
        for el in cycle(self.__color):
            print(f'{el[0]}')
            sleep(el[1]) # не работает слип :С нет ожидания n сек, а есть ожидание n*число шагов цикла сек, то есть программа засывает тут же после работы на всё суммарное время. И я не знаю, что с этим делать :С
            
trlight = TrafficLight()
trlight.running()
    
    



