#Спортсмен занимается ежедневными пробежками.
#В первый день его результат составил А км
#Каждый день спортсмен увеличивал результат на 10% остносительно предыдущего.
#Требуется определить номер дня, на который езультат спортсмена составит не менее Б км.
#Программа должна принимать значения параметров А и Б
# и выводить одно натуральное число - номер дня.

#дополнительно будем считать, что результат достигается в тот день,
#когда достигается первый >= Б резальтат
#кроме того, первый день, когда был достигнут первый результат,
#будем считать 0-днём (это не важно, но пусть будет определённость)

a = int(input('Введите результат спортсмена-бегуна в первый день, км:'))
b = int(input('Введите необходимый результат спортсмена-бегуна, км:'))
c = 0.1
#для дебага c = int(input('Введите скорость увеличения результата спортсмена бегуна, %:'))/100

#заметим, что имеет место формула
#ai = a0 (с+1) ** i, где ai = b, i - номер шага
#получаем логарифмическую формулу
#i = log (b/a0) по основанию(c+1)
#но для логарифмов нужен математический пакет,
#а это выходит за условия задачи
#поэтому решаем циклом

d=0
i=0
while d <= b:
    d = a * ((c+1)**i)
    i += 1
print('Результат', b,'км в день достигается на', i, 'день')