#Создать список
#и заполнить его элементами различных типов данных.
#Реализовать скрипт проверки типа данных
#каждого элемента.
#Использовать функцию type()
#для проверки типа.
#Элементы списка можно не запрашивать
#у пользователя, а указать явно,
#в программе.

#создаю список
my_list = []

#заполняю список явно, в программе
my_list.append('ололо')
my_list.append(17)
my_list.append(13.2)
my_list.append(complex(12,12))
my_list.append(my_list)

#ставлю в соответствие элементу списка элемент списка "тип данных"
i = 0
my_list_type = []
while i < len(my_list):
    my_list_type.append(type(my_list[i]))
    print(my_list[i], 'имеет тип данных ', my_list_type[i])
    i += 1