#Реализовать структуру "Рейтинг",
#представляющую собой не возрастающий набор натуральных чисел.
#У пользователя необходимо запрашивать новый элемент рейтинга.
#Если в рейтинге существуют элементы с одинаковыми значениями,
#то новый элемент с тем же значением должен разместиться после них.

#У пользователя необходимо запрашивать новый элемент рейтинга.
#чтобы это происходило не бесконечно ограничим структуру длиной
my_list_len = int(input('Введите число элементов структуры: ')) - 1
my_list = [7,5,3,3,2] #пусть уже будет предустановлен непустой список
i = 0
while i <= my_list_len:
    new_number = int(input('Введите число: '))
    my_list.append(new_number)
    my_list.sort()
    print('Текущий рейтинг:',my_list)
    i += 1