'''
    Реализовать структуру данных "Товары".
    Она должна представлять собой список кортежей.
    Каждый кортеж хранит информацию об отдельном товаре.
    В кортеже должно быть два элемента
    - номер товара и словарь с параметрами
    (характеристиками товара: название, цена, количество, единица измерения)
    Структуру нажно сформировать программно, т.е. запрашивать все данные у пользователя.
    Необходимо собрать аналитику о товарах.
    Реализовать словарь, в котором каждый ключ - характеристика товара,
    например, название, а значение - список значений-характеристик,
    например, список названий товаров
'''

# сделаем допущение, что эти 2 функции должны быть реализованы раздельно
# думая, что посередине может быть ещё как-то процесс с этими данными

for_tuple_dummy_list = []
structure_list = []
for_structure_dummy_tuple = ()
dummy_dict = {'name':'','cost':'','units':'','unit':''}

num_prod = int(input('Сколько будет товаров? ')) 

i = 1
while i <= num_prod:
    for_tuple_dummy_list.append(i) 
    print(f'Ввод данных по товару с id = {i}: ')
    name = str(input('1. Введите название товара: '))
    cost = int(input('2. Введите цену товара: '))
    units = int(input('3. Введите количество товара: '))
    unit = str(input('4. Введите единицу измерения товара: '))
    dummy_dict = {'name':name,'cost':cost,'units':units,'unit':unit}
    for_tuple_dummy_list.append(dummy_dict)
    for_structure_dummy_tuple = tuple(for_tuple_dummy_list) 
    structure_list.append(for_structure_dummy_tuple)
    for_tuple_dummy_list = []
    i += 1
print(f'Структура товаров: {structure_list}')

# мы будем считать, что нам известна структура данных, что
# список = список(кортеж(товары)) =
# = список(кортеж(ид,справочник(характеристики))).
# разворачиваем структуру как луковицу и вытаскиваем
# нужные показатели по ключам и заворачиваем их в список
# список в яйцо, яйцо в утку, утку в зайца, зайца в сундук
# всё как мы любим и ни в чём себе не отказываем

for_analytics_dict = {}
dummy_list = []
i = 0
dummy_dict = {'name':'','cost':'','units':'','unit':''}
for le in ['name','cost','units','unit']:
    for el in structure_list: 
        dummy_list.append(el[1].get(le)) 
        dummy_dict = {le:dummy_list}
        for_analytics_dict.update(dummy_dict)
    dummy_list = []
print(f'Словарь, в котором каждый ключ... : {for_analytics_dict}')