# Программа принимает действительное положительное число x и целое отрицательное число
# y. Необходимо выполнить возведение числа x в степень y. Задание необходимо реализовать
# в виде функции my_func(x, y). При решении задания необходимо обойтись без встроенной
# функции возведения числа в степень.
# Подсказка: попробуйте решить задачу двумя способами. Первый — возведение в степень с
# помощью оператора **. Второй — более сложная реализация без оператора **,
# предусматривающая использование цикла.

#----------------------------------------- Functions ----------------------------------------

def my_func(x, y):
    ''' Функция возвращает первый аргумент в степени второго аргумента '''
    return x**y

def my_func2(x, y):
    i = 1
    while i < abs(y):
        x = x * x
        i += 1
    return 1/x

#----------------------------------------- Code ----------------------------------------

print(my_func(1.1,-2))
print(my_func2(1.1,-2))