'''
    Программа запрашивает у пользователя строку чисел, разделенных пробелом. При нажатии
    Enter должна выводиться сумма чисел. Пользователь может продолжить ввод чисел,
    разделенных пробелом и снова нажать Enter. Сумма вновь введенных чисел будет
    добавляться к уже подсчитанной сумме. Но если вместо числа вводится специальный символ,
    выполнение программы завершается. Если специальный символ введен после нескольких
    чисел, то вначале нужно добавить сумму этих чисел к полученной ранее сумме и после этого
    завершить программу.
'''

#----------------------------------------- Functions ----------------------------------------

def sum_func():
    ''' Функция суммирует перечисленные через пробел числа и останавливает суммирование по символу !'''
    summ = 0
    check = True 
    while check == True:
        a = input('Введите числа, разделённые побелом или поставьте "!", чтобы прервать суммирование элементов: ') # 1 2 3 4 5
        my_list = a.split()
#        print(my_list)
#        print(my_list.count('!'))
        i = 0
        for el in my_list:
            if el == '!':
                check = False
                print('Завершение программы.')
                break
            else:
                el = int(el)
                summ = el + summ
        print(f'Сумма чисел: {summ}')
    return summ

#----------------------------------------- Code ----------------------------------------

sum_func()
