'''
    Реализовать программу работы с органическими клетками, состоящими из ячеек. Необходимо
    создать класс Клетка. В его конструкторе инициализировать параметр, соответствующий
    количеству ячеек клетки (целое число). В классе должны быть реализованы методы
    перегрузки арифметических операторов: сложение ( __add__() ), вычитание ( __sub__()) ,
    умножение ( __mul__()) , деление ( __truediv__()) . Данные методы должны применяться т олько
    к клеткам и выполнять увеличение, уменьшение, умножение и обычное (не целочисленное)
    деление клеток, соответственно. В методе деления должно осуществляться округление
    значения до целого числа.
    Сложение. Объединение двух клеток. При этом число ячеек общей клетки должно равняться
    сумме ячеек исходных двух клеток.
    Вычитание. Участвуют две клетки. Операцию необходимо выполнять только если разность
    количества ячеек двух клеток больше нуля, иначе выводить соответствующее сообщение.
    Умножение. Создается общая клетка из двух. Число ячеек общей клетки определяется как
    произведение количества ячеек этих двух клеток.
    Деление. Создается общая клетка из двух. Число ячеек общей клетки определяется как
    целочисленное деление количества ячеек этих двух клеток.
    В классе необходимо реализовать метод make_order(), принимающий экземпляр класса и
    количество ячеек в ряду. Данный метод позволяет организовать ячейки по рядам.
    Метод должен возвращать строку вида * ****\n*****\n*****. .., где количество ячеек между \ n
    равно переданному аргументу. Если ячеек на формирование ряда не хватает, то в последний
    ряд записываются все оставшиеся.
    Например, количество ячеек клетки равняется 12, количество ячеек в ряду — 5. Тогда метод
    make_order() вернет строку: *****\n*****\n** .
    Или, количество ячеек клетки равняется 15, количество ячеек в ряду — 5. Тогда метод
    make_order() вернет строку: *****\n*****\n***** .
'''


class Cell:
    ''' класс Клетка, состоящая из ячеек, с опр сложением, вычитаением, умножением и делением '''
    def __init__(self, sq_num = 0):
        ''' параметр числа ячеек Клетки '''
        self.sq_num = sq_num
        
    def __add__(self, other):
        ''' сложение 2 клеток '''
        return Cell(self.sq_num + other.sq_num)
    
    def __sub__(self, other):
        ''' разность 2 клеток '''
        if self.sq_num >= other.sq_num:
            return Cell(self.sq_num - other.sq_num)
        else:
            print('Разность клеток даёт отрицательные значения, это невозможно произвести')
            
    def __mul__(self, other):
        ''' умножение 2 клеток '''
        return Cell(self.sq_num * other.sq_num)
    
    def __truediv__(self, other):
        ''' деление 2 клеток '''
        return Cell(self.sq_num // other.sq_num)
    
    def make_order(self, num_sq_of_str):
        ''' формирует ряды из ячеек Клетки. Добавляет в последний ряд оставшиеся формируя этот ряд '''
        sq_of_str_list = [['*' for el in range(0, int(num_sq_of_str))] for i in range(0, self.sq_num // num_sq_of_str)]
        b = self.sq_num % num_sq_of_str != 0
        if b:
            sq_of_str_list.append(['*' for el in range(0, self.sq_num % num_sq_of_str)])
        for el in sq_of_str_list:
            print(el) # в конец добавляется None, не понимаю, почему
            
    def make_order_next_var(self, num_sq_of_str):
        ''' формирует ряды из ячеек Клетки. Добавляет в последний ряд оставшиеся, догружая в него сверх меры '''
        sq_of_str_list = [['*' for el in range(0, int(num_sq_of_str))] for i in range(0, self.sq_num // num_sq_of_str)]
        b = self.sq_num % num_sq_of_str != 0
        if b:
            for el in range(0, self.sq_num % num_sq_of_str):
                sq_of_str_list[len(sq_of_str_list)-1].append('*')
        for el in sq_of_str_list:
            print(el) # в конец добавляется None, не понимаю, почему
        
cell = Cell(14)

print(cell.make_order(6))
print(cell.make_order_next_var(6))
















