''' Задача 5.6. Условие:
    Необходимо создать (не программно) текстовый файл, где каждая строка описывает учебный
    предмет и наличие лекционных, практических и лабораторных занятий по этому предмету и их
    количество. Важно, чтобы для каждого предмета не обязательно были все типы занятий.
    Сформировать словарь, содержащий название предмета и общее количество занятий по
    нему. Вывести словарь на экран.
    Примеры строк файла:
    Информатика: 100(л) 50(пр) 20(лаб).
    Физика: 30(л) — 10(лаб)
    Физкультура: — 30(пр) —
    Пример словаря: {“Информатика”: 170, “Физика”: 40, “Физкультура”: 30}
'''

type_lesson_list = ['(пр)', '(лаб)', '(л)']
dict_content = {}

with open('text.txt', 'r') as text:
    for line in text:
        line_list = line.split()
        summ = 0
        line_list = [el for el in line_list if el != '—'] #очистка списка от отсутствующего типа занятия
        line_list[0] = line_list[0].replace(':','') #очистка строки от двоеточия
        for i in range(1, len(line_list)): #очистка от типа занятия 
            for j in type_lesson_list:
                line_list[i] = line_list[i].replace(j, '')
            summ += int(line_list[i])
            dict_dummy = {line_list[0]: summ}
            dict_content.update(dict_dummy)
        print(dict_content)
        
        